In [1]:
import pandas as pd
import numpy as np

Main data structures: 
- **1D objects** like 1D arrays or columns in a spreadsheet
- **2D objects** with much the same behaviour, methods and indexing logic as numpy arrays
- both rows and columns of dataframes are series 
- most, but not all dataframe functionality applies to series, as well (without axis arguments, of course)

In [2]:
df = pd.DataFrame([["Python","multi", "Guido van Rossum", 1995, 3],
                    ["Lisp","multi", "John McCarthy", 1958, 33],
                    ["C++", "multi", "Bjarne Stroustrup", 1985, 4],
                    ["Java", "multi", "James Gosling", 1996, 1],
                    ["Haskell","functional", "Lennart Augustsson", 1990, 40],
                    ["Prolog", "logic", "Alain Colmerauer", 1972,  36]], 
                  columns=["name", "paradigm", "creator", "year", "popularity_rank"])

df

      name    paradigm             creator  year  popularity_rank
0   Python       multi    Guido van Rossum  1995                3
1     Lisp       multi       John McCarthy  1958               33
2      C++       multi   Bjarne Stroustrup  1985                4
3     Java       multi       James Gosling  1996                1
4  Haskell  functional  Lennart Augustsson  1990               40
5   Prolog       logic    Alain Colmerauer  1972               36

In [3]:
serie = pd.Series(["Python","Multi",1995])
serie

0    Python
1     Multi
2      1995
dtype: object

In [4]:
display(pd.DataFrame(np.arange(70*90).reshape(70,90)))

,0,1,2,3,4,5,6,7,8,9,...,80,81,82,83,84,85,86,87,88,89
0,0,1,2,3,4,5,6,7,8,9,...,80,81,82,83,84,85,86,87,88,89
1,90,91,92,93,94,95,96,97,98,99,...,170,171,172,173,174,175,176,177,178,179
2,180,181,182,183,184,185,186,187,188,189,...,260,261,262,263,264,265,266,267,268,269
3,270,271,272,273,274,275,276,277,278,279,...,350,351,352,353,354,355,356,357,358,359
4,360,361,362,363,364,365,366,367,368,369,...,440,441,442,443,444,445,446,447,448,449
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65,5850,5851,5852,5853,5854,5855,5856,5857,5858,5859,...,5930,5931,5932,5933,5934,5935,5936,5937,5938,5939
66,5940,5941,5942,5943,5944,5945,5946,5947,5948,5949,...,6020,6021,6022,6023,6024,6025,6026,6027,6028,6029
67,6030,6031,6032,6033,6034,6035,6036,6037,6038,6039,...,6110,6111,6112,6113,6114,6115,6116,6117,6118,6119
68,6120,6121,6122,6123,6124,6125,6126,6127,6128,6129,...,6200,6201,6202,6203,6204,6205,6206,6207,6208,6209
69,6210,6211,6212,6213,6214,6215,6216,6217,6218,6219,...,6290,6291,6292,6293,6294,6295,6296,6297,6298,6299

In [5]:
# Show max rows and cloumns that we would like to show

# with pd.option_context("display.max_rows",100,"display.max_columns",100):
#     display(pd.DataFrame(np.arange(70*90).reshape(70,90)))

#### Setting an Index

In [6]:
df2 = pd.DataFrame([["Python","multi", "Guido van Rossum", 1995, 3],
                    ["Lisp","multi", "John McCarthy", 1958, 33],
                    ["C++", "multi", "Bjarne Stroustrup", 1985, 4],
                    ["Java", "multi", "James Gosling", 1996, 1],
                    ["Haskell","functional", "Lennart Augustsson", 1990, 40],
                    ["Prolog", "logic", "Alain Colmerauer", 1972,  36]], 
                  columns=["name", "paradigm", "creator", "year", "popularity_rank"],
                  index=["Python", "Lisp", "C++", "Java", "Haskell", "Prolog"])

df2

            name    paradigm             creator  year  popularity_rank
Python    Python       multi    Guido van Rossum  1995                3
Lisp        Lisp       multi       John McCarthy  1958               33
C++          C++       multi   Bjarne Stroustrup  1985                4
Java        Java       multi       James Gosling  1996                1
Haskell  Haskell  functional  Lennart Augustsson  1990               40
Prolog    Prolog       logic    Alain Colmerauer  1972               36

Another way to do this is using the `.set_index()` DataFrame method, whose arguments are
* the column name to use as index, and optionally, among others:
* `append` if columns should be appended to existing index to create a multi-level index (by default False, and we will only be looking at MultiIndexes much later)
    * caution: if `append=False`, the original index is simply dropped
* `inplace` if original dataframe should be modified (by default False)

In [7]:
df.set_index("name",inplace=True)
df

           paradigm             creator  year  popularity_rank
name
Python        multi    Guido van Rossum  1995                3
Lisp          multi       John McCarthy  1958               33
C++           multi   Bjarne Stroustrup  1985                4
Java          multi       James Gosling  1996                1
Haskell  functional  Lennart Augustsson  1990               40
Prolog        logic    Alain Colmerauer  1972               36

And reset it with `.reset_index()` method (which can also take the optional `inplace` argument).

In [8]:
df.reset_index(inplace=True)
df

      name    paradigm             creator  year  popularity_rank
0   Python       multi    Guido van Rossum  1995                3
1     Lisp       multi       John McCarthy  1958               33
2      C++       multi   Bjarne Stroustrup  1985                4
3     Java       multi       James Gosling  1996                1
4  Haskell  functional  Lennart Augustsson  1990               40
5   Prolog       logic    Alain Colmerauer  1972               36

The `inplace` argument is a fairly general feature of pandas methods:
* if True, changes the original dataframe, and doesn't return anything
* if False, leaves original dataframe intact, and returns a new, changed dataframe.

#### Initializing Series or DataFrame from a dictionary

In [9]:
mydict = {
'name': ['Python',
          'Lisp',
          'C++',
          'Java',
          'Haskell',
          'Prolog'],
'creator': ['Guido van Rossum',
            'John McCarthy',
            'Bjarne Stroustrup',
            'James Gosling',
            'Lennart Augustsson',
            'Alain Colmerauer'],
'year': [1995, 1958, 1985, 1996, 1990, 1972],
 }

pd.DataFrame(mydict)

      name             creator  year
0   Python    Guido van Rossum  1995
1     Lisp       John McCarthy  1958
2      C++   Bjarne Stroustrup  1985
3     Java       James Gosling  1996
4  Haskell  Lennart Augustsson  1990
5   Prolog    Alain Colmerauer  1972

In [10]:
pd.Series(mydict)

name              [Python, Lisp, C++, Java, Haskell, Prolog]
creator    [Guido van Rossum, John McCarthy, Bjarne Strou...
year                    [1995, 1958, 1985, 1996, 1990, 1972]
dtype: object

In [11]:
mydict2 = {k:mydict[k][0] for k in mydict.keys()}
mydict2

{'name': 'Python', 'creator': 'Guido van Rossum', 'year': 1995}

In [12]:
pd.Series(mydict2)

name                 Python
creator    Guido van Rossum
year                   1995
dtype: object

## Accessing columns, rows, cells, slices...

Depending on what parts of a data frame we access, we get different types of objects:

* accessing columns or rows -> pd.Series
* accessing a cell -> whatever type that particular cell is
* accessing 2D parts of the data frame -> pd.DataFrame

In [13]:
df

      name    paradigm             creator  year  popularity_rank
0   Python       multi    Guido van Rossum  1995                3
1     Lisp       multi       John McCarthy  1958               33
2      C++       multi   Bjarne Stroustrup  1985                4
3     Java       multi       James Gosling  1996                1
4  Haskell  functional  Lennart Augustsson  1990               40
5   Prolog       logic    Alain Colmerauer  1972               36

The first and last $n$ rows (the default is 5) of a data frame or series can be quickly inspected by `.head()` and `.tail()` methods

In [14]:
df.head(2)

     name paradigm           creator  year  popularity_rank
0  Python    multi  Guido van Rossum  1995                3
1    Lisp    multi     John McCarthy  1958               33

In [15]:
df.tail(2)

      name    paradigm             creator  year  popularity_rank
4  Haskell  functional  Lennart Augustsson  1990               40
5   Prolog       logic    Alain Colmerauer  1972               36

Column lables `.columns`

In [16]:
df.columns

Index(['name', 'paradigm', 'creator', 'year', 'popularity_rank'], dtype='object')

In [17]:
# Values of columns can also be set
df.columns = ['name','paradigm', 'creator', 'year', 'tiobe_idx']
df

      name    paradigm             creator  year  tiobe_idx
0   Python       multi    Guido van Rossum  1995          3
1     Lisp       multi       John McCarthy  1958         33
2      C++       multi   Bjarne Stroustrup  1985          4
3     Java       multi       James Gosling  1996          1
4  Haskell  functional  Lennart Augustsson  1990         40
5   Prolog       logic    Alain Colmerauer  1972         36

Index `.index`

In [18]:
df.set_index("name",inplace=True)
df.index

Index(['Python', 'Lisp', 'C++', 'Java', 'Haskell', 'Prolog'], dtype='object', name='name')

Series only have index, no column

In [19]:
x = pd.Series(range(100,105))
x.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
x.index = x.index + 5
x

5    100
6    101
7    102
8    103
9    104
dtype: int64

#### Accessing columns

In [21]:
df["creator"]

name
Python       Guido van Rossum
Lisp            John McCarthy
C++         Bjarne Stroustrup
Java            James Gosling
Haskell    Lennart Augustsson
Prolog       Alain Colmerauer
Name: creator, dtype: object

In [22]:
df.creator

name
Python       Guido van Rossum
Lisp            John McCarthy
C++         Bjarne Stroustrup
Java            James Gosling
Haskell    Lennart Augustsson
Prolog       Alain Colmerauer
Name: creator, dtype: object

In [23]:
# Columns or rows are series
type(df["creator"])

pandas.core.series.Series

In [24]:
# Multiple columns can be accessed using lists
df[["creator","year"]]

                    creator  year
name
Python     Guido van Rossum  1995
Lisp          John McCarthy  1958
C++       Bjarne Stroustrup  1985
Java          James Gosling  1996
Haskell  Lennart Augustsson  1990
Prolog     Alain Colmerauer  1972

In [25]:
type(df[["creator","year"]])

pandas.core.frame.DataFrame

In [26]:
# Values also can be set
df["constant"] = "Test"
df["id"] = np.arange(len(df))
df

           paradigm             creator  year  tiobe_idx constant  id
name
Python        multi    Guido van Rossum  1995          3     Test   0
Lisp          multi       John McCarthy  1958         33     Test   1
C++           multi   Bjarne Stroustrup  1985          4     Test   2
Java          multi       James Gosling  1996          1     Test   3
Haskell  functional  Lennart Augustsson  1990         40     Test   4
Prolog        logic    Alain Colmerauer  1972         36     Test   5

#### Accessing Rows
The same logic applies as with columns, but they must be accessed using .`loc[]` instead of simple square brackets

In [27]:
df.loc["Python"]

paradigm                multi
creator      Guido van Rossum
year                     1995
tiobe_idx                   3
constant                 Test
id                          0
Name: Python, dtype: object

#### row index for **ndarray** vs. column label for **pd.DataFrame**

Caution: 
* `a[i]` returns the ith row of an ndarray (_i_ is a **row index**)
* `df[i]` returns column with the label _i_ of a dataframe (_i_ is a **column label**)!
    * If _i_ is not a column label, you get a KeyError!

In [28]:
print("Row index for ndarrays...\n")
a = np.array(range(6)).reshape(2,3)
print("array a:\n", a)

print("\na[1]:")
a[1]

Row index for ndarrays...

array a:
 [[0 1 2]
 [3 4 5]]

a[1]:

array([3, 4, 5])

In [29]:
print("Column labels for dataframes...\n")

print("Our dataframe:")
display(df)

print("\ndf[1]:")
try:
    print(df[1])
except Exception as e:
    print(f"Exception ({type(e).__name__}):",  e)

Column labels for dataframes...

Our dataframe:

           paradigm             creator  year  tiobe_idx constant  id
name
Python        multi    Guido van Rossum  1995          3     Test   0
Lisp          multi       John McCarthy  1958         33     Test   1
C++           multi   Bjarne Stroustrup  1985          4     Test   2
Java          multi       James Gosling  1996          1     Test   3
Haskell  functional  Lennart Augustsson  1990         40     Test   4
Prolog        logic    Alain Colmerauer  1972         36     Test   5

df[1]:
Exception (KeyError): 1

In [30]:
print("Column labels for dataframes...\n")

d = pd.DataFrame(a)
print("A dataframe:")
display(d)

print("\nd[1]:")
try:
    print(d[1])
except Exception as e:
    print(f"Exception ({type(e).__name__}):",  e)

Column labels for dataframes...

A dataframe:

   0  1  2
0  0  1  2
1  3  4  5

d[1]:
0    1
1    4
Name: 1, dtype: int32

#### .loc[] vs. .iloc[]

* `loc` can also be used to access 2-dimensional ranges, not just single rows
    * But it uses **labels** for selecting the rows and columns
    * And it **includes both endpoints of a slice**!
* `iloc` is the pandas equivalent of numpy array indexing
    * uses **integer indices** starting from 0: index _i_ accesses the _i_th row/column
    * like regular python and numpy indexing, **includes start, but excludes endpoint**

Commonalities:
* Usage: `.(i)loc[rowindexer, columnindexer]`, where columnindexer is optional. The **indexers** can be
    * single values (like `1`)
    * lists or ranges (like `[1, 3]`)
    * slices (even the labels for .loc!) (like `1:3`)
* Caution: .iloc and .loc are **not methods** --- they take square brackets [ ], not ()!!!

In [31]:
df

           paradigm             creator  year  tiobe_idx constant  id
name
Python        multi    Guido van Rossum  1995          3     Test   0
Lisp          multi       John McCarthy  1958         33     Test   1
C++           multi   Bjarne Stroustrup  1985          4     Test   2
Java          multi       James Gosling  1996          1     Test   3
Haskell  functional  Lennart Augustsson  1990         40     Test   4
Prolog        logic    Alain Colmerauer  1972         36     Test   5

In [32]:
df.loc[["Lisp","Java"],["year","tiobe_idx"]]

      year  tiobe_idx
name
Lisp  1958         33
Java  1996          1

In [33]:
df.iloc[[1,3],[2,3]]

      year  tiobe_idx
name
Lisp  1958         33
Java  1996          1

`Multipple rows, single column = Series`

In [34]:
df.loc[["Lisp","Java"],"year"]

name
Lisp    1958
Java    1996
Name: year, dtype: int64

In [35]:
df.iloc[[1,3],2]

name
Lisp    1958
Java    1996
Name: year, dtype: int64

`Multiple rows, single column as a list = dataframe`

In [36]:
df.loc[["Lisp","Java"],["year"]]

      year
name
Lisp  1958
Java  1996

In [37]:
df.iloc[[1, 3], [1]]

            creator
name
Lisp  John McCarthy
Java  James Gosling

`Single row, single column = cell`

In [38]:
df.loc["Lisp","year"]

1958

In [39]:
df.iloc[0,0]

'multi'

Using Slices

In [40]:
df.loc["Lisp":"Java","creator":"tiobe_idx"]

                creator  year  tiobe_idx
name
Lisp      John McCarthy  1958         33
C++   Bjarne Stroustrup  1985          4
Java      James Gosling  1996          1

In [41]:
df.iloc[:3,1:3]

                  creator  year
name
Python   Guido van Rossum  1995
Lisp        John McCarthy  1958
C++     Bjarne Stroustrup  1985

#### Caution: do not mix up .loc and .iloc especially with numeric indexes!

In [42]:
print("A dataframe with numeric labels:")
d = pd.DataFrame([[1, 2, 3], [4, 5, 6]], index=[1, 2])
d

A dataframe with numeric labels:

   0  1  2
1  1  2  3
2  4  5  6

In [43]:
print(".iloc[1] selects row index 1:")
d.iloc[1]

.iloc[1] selects row index 1:

0    4
1    5
2    6
Name: 2, dtype: int64

In [44]:
print(".loc[1] selects row with label 1:")
d.loc[1]

.loc[1] selects row with label 1:

0    1
1    2
2    3
Name: 1, dtype: int64

#### Conditions and boolean masks

* The way we worked with numpy arrays and conditions used as boolean masks carries over to pandas, as well.

* But caution: `.all()` and `.any()` methods on DataFrames use **axis=0 by default**!

In [45]:
d2 = pd.DataFrame([[3,"two",1],[3,3,3]],
                  columns=[f'col{i}' for i in range(3)],
                  index=[f'row{i}' for i in range(2)])
d2

      col0 col1  col2
row0     3  two     1
row1     3    3     3

In [46]:
print(d2 == 3)

      col0   col1   col2
row0  True  False  False
row1  True   True   True

In [47]:
print(d2[d2 == 3])

      col0 col1  col2
row0     3  NaN   NaN
row1     3    3   3.0

In [48]:
print(d2[(d2 == 3) | (d2 == "two")])

      col0 col1  col2
row0     3  two   NaN
row1     3    3   3.0

Using .all() and .any():

In [49]:
d2 == 3

      col0   col1   col2
row0  True  False  False
row1  True   True   True

In [50]:
(d2 == 3).all()

col0     True
col1    False
col2    False
dtype: bool

In [51]:
(d2 == 3).all(axis=1)

row0    False
row1     True
dtype: bool

In [52]:
# Rows when all values are 3
print(d2[(d2 == 3).all(axis=1)])

      col0 col1  col2
row1     3    3     3

In [53]:
# Rows when not all values are 3
print(d2[~ (d2 == 3).all(axis=1)])
print(d2[(d2 != 3).any(axis=1)])

      col0 col1  col2
row0     3  two     1
      col0 col1  col2
row0     3  two     1

Boolean column selection is a bit more contrived...

In [54]:
# Columns where all cell values are 3
print( d2[ d2.columns[ (d2 == 3).all()] ])

      col0
row0     3
row1     3

In [55]:
# Columns where all cell values are 3 (using transposition)
d2.T[ (d2.T == 3).all(axis=1) ].T

     col0
row0    3
row1    3

#### Descriptive and Basic info

In [56]:
df.describe()

              year  tiobe_idx        id
count     6.000000   6.000000  6.000000
mean   1982.666667  19.500000  2.500000
std      14.908610  18.598387  1.870829
min    1958.000000   1.000000  0.000000
25%    1975.250000   3.250000  1.250000
50%    1987.500000  18.500000  2.500000
75%    1993.750000  35.250000  3.750000
max    1996.000000  40.000000  5.000000

In [57]:
# If there are numerical columns then only those columns' statistics are included by default --
# the include parameter can be used to produce all:
df.describe(include="all")

       paradigm           creator         year  tiobe_idx constant        id
count         6                 6     6.000000   6.000000        6  6.000000
unique        3                 6          NaN        NaN        1       NaN
top       multi  Guido van Rossum          NaN        NaN     Test       NaN
freq          4                 1          NaN        NaN        6       NaN
mean        NaN               NaN  1982.666667  19.500000      NaN  2.500000
std         NaN               NaN    14.908610  18.598387      NaN  1.870829
min         NaN               NaN  1958.000000   1.000000      NaN  0.000000
25%         NaN               NaN  1975.250000   3.250000      NaN  1.250000
50%         NaN               NaN  1987.500000  18.500000      NaN  2.500000
75%         NaN               NaN  1993.750000  35.250000      NaN  3.750000
max         NaN               NaN  1996.000000  40.000000      NaN  5.000000

.describe() also works for series, e.g., taking a column:

In [58]:
df['year'].describe()

count       6.000000
mean     1982.666667
std        14.908610
min      1958.000000
25%      1975.250000
50%      1987.500000
75%      1993.750000
max      1996.000000
Name: year, dtype: float64

Basic (and less basic) descriptives of dataframes and series can also be accessed via dedicated aggregation methods like `.min()`, `.max()`, `.mean()`, `.median()`, `.std()`, `.count()`, etc.

-> Unlike their numpy counterparts, argumentless versions of pandas methods do NOT work on flattened values, but assume `axis=0` by default!

In [59]:
df.count()

paradigm     6
creator      6
year         6
tiobe_idx    6
constant     6
id           6
dtype: int64

In [60]:
df.count(axis=1)

name
Python     6
Lisp       6
C++        6
Java       6
Haskell    6
Prolog     6
dtype: int64

In [61]:
df.mean()

C:\Users\malir\AppData\Local\Temp\ipykernel_6536\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

year         1982.666667
tiobe_idx      19.500000
id              2.500000
dtype: float64

#### Unique values and value counts
In many cases, it is useful to see the unique values, sometimes together with the number of times they occur.
* `.unique()`
* `.nunique()`
* `.value_counts()`

In [65]:
df.paradigm.unique()

array(['multi', 'functional', 'logic'], dtype=object)

In [70]:
df.paradigm.nunique()

3

In [69]:
df.paradigm.value_counts()

multi         4
functional    1
logic         1
Name: paradigm, dtype: int64

#### Types

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Python to Prolog
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   paradigm   6 non-null      object
 1   creator    6 non-null      object
 2   year       6 non-null      int64
 3   tiobe_idx  6 non-null      int64
 4   constant   6 non-null      object
 5   id         6 non-null      int32
dtypes: int32(1), int64(2), object(3)
memory usage: 484.0+ bytes

In [73]:
df.dtypes

paradigm     object
creator      object
year          int64
tiobe_idx     int64
constant     object
id            int32
dtype: object

In [74]:
df.year.dtype

dtype('int64')

As we see, the datatype logic is similar to numpy arrays.However, pandas is much more lenient and exercises more coercion.

In [75]:
a = np.array([1, 1, 2])
print("array of dtype", a.dtype)
print(a, "\n\ntrying to set a value to a string:")
try:
    a[0] = "one"
except Exception as e:
    print(f"Exception ({type(e).__name__})", e)

array of dtype int32
[1 1 2]

trying to set a value to a string:
Exception (ValueError) invalid literal for int() with base 10: 'one'

In [76]:
d = pd.DataFrame(np.array(range(6)).reshape(2,3))
print("dataframe with dtypes...")
display(d.dtypes)
print()
display(d)
print("\nsetting one value to a string:")
d.iloc[0,0] = "one"
display(d)
print("\nnow the dataframe dtypes...")
display(d.dtypes)

dataframe with dtypes...

0    int32
1    int32
2    int32
dtype: object

   0  1  2
0  0  1  2
1  3  4  5

setting one value to a string:

     0  1  2
0  one  1  2
1    3  4  5

now the dataframe dtypes...

0    object
1     int32
2     int32
dtype: object

Also, individual values are not coerced into the umbrella dtype:

In [77]:
print("A numpy array:")
a = np.array([1, "one", 3.0])
print(a)
print()
for item in a:
    print("\t", item, "\t", type(item))

A numpy array:
['1' 'one' '3.0']

	 1 	 <class 'numpy.str_'>
	 one 	 <class 'numpy.str_'>
	 3.0 	 <class 'numpy.str_'>

In [78]:
print("A Series:")
a = pd.Series([1, "one", 3.0])
print(a)
print()
for item in a.values:
    print("\t", item, "\t", type(item))

A Series:
0      1
1    one
2    3.0
dtype: object

	 1 	 <class 'int'>
	 one 	 <class 'str'>
	 3.0 	 <class 'float'>

But caution: this also means that the column dtype is not updated even if all of its members are now of a different type:

In [79]:
a.iloc[1] = 2
print("Now all items of the series are numeric...")
print(a)
print()
for item in a.values:
    print("\t", item, "\t", type(item))

Now all items of the series are numeric...
0      1
1      2
2    3.0
dtype: object

	 1 	 <class 'int'>
	 2 	 <class 'int'>
	 3.0 	 <class 'float'>

#### Datafram And Series Manipulation

In [82]:
d = pd.DataFrame(np.arange(6).reshape(2,3))
d

   0  1  2
0  0  1  2
1  3  4  5

In [83]:
d2 = d.copy()
d2.iloc[0,0] = 100
display(d2)
display(d)

     0  1  2
0  100  1  2
1    3  4  5

   0  1  2
0  0  1  2
1  3  4  5

In [84]:
d2 = d
d2.iloc[0,0] = 100
display(d2)
display(d)

     0  1  2
0  100  1  2
1    3  4  5

     0  1  2
0  100  1  2
1    3  4  5

In [85]:
d = pd.DataFrame(np.arange(15).reshape(3,5))
d

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [86]:
d2 = pd.DataFrame(np.arange(100,110).reshape(2,5))
d2

     0    1    2    3    4
0  100  101  102  103  104
1  105  106  107  108  109

By default, as always, `axis=0` is assumed = concatenation of rows:

In [87]:
pd.concat([d,d2])

     0    1    2    3    4
0    0    1    2    3    4
1    5    6    7    8    9
2   10   11   12   13   14
0  100  101  102  103  104
1  105  106  107  108  109

To concatenate along columns

In [88]:
pd.concat([d,d2],axis=1)

    0   1   2   3   4      0      1      2      3      4
0   0   1   2   3   4  100.0  101.0  102.0  103.0  104.0
1   5   6   7   8   9  105.0  106.0  107.0  108.0  109.0
2  10  11  12  13  14    NaN    NaN    NaN    NaN    NaN

* Note that `concat` observes the labels of the other axis.
* It also observes the order of the concatenated arguments.
* Series can also be concatenated:

In [89]:
pd.concat([d[0],d2[0]])

0      0
1      5
2     10
0    100
1    105
Name: 0, dtype: int32

#### Elementwise Operations
Most basic operations are elementwise, as in the case of numpy arrays.

In [93]:
d = pd.DataFrame(np.ones(6).reshape(2,3))
d + 1

     0    1    2
0  2.0  2.0  2.0
1  2.0  2.0  2.0

There are of course likewise also methods that work elementwise, e.g., `.abs()`

In [94]:
d.iloc[0,1:] = -2
d

     0    1    2
0  1.0 -2.0 -2.0
1  1.0  1.0  1.0

In [95]:
d.abs()

     0    1    2
0  1.0  2.0  2.0
1  1.0  1.0  1.0

#### Aggregation/Reduction methods and mapping values

In [100]:
d = pd.DataFrame(np.arange(15).reshape(3,5))
d

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [101]:
d.sum()

0    15
1    18
2    21
3    24
4    27
dtype: int64

In [102]:
d.sum(1)

0    10
1    35
2    60
dtype: int64

In [103]:
d.mean()

0    5.0
1    6.0
2    7.0
3    8.0
4    9.0
dtype: float64

In [104]:
d.mean().mean()

7.0

Series and DataFrames have dedicated methods to efficiently apply functions to cells or parts.

Methods for Series:
* `.map()` to apply a function to each cell

Methods for DataFrames:
* `.applymap()` to apply a function to each cell
* `.apply()`
    * `axis=0` to apply a function to each column (default!)
    * `axis=1` to apply a function to each row

In [105]:
s = pd.Series(["one", "two", "three", "go"])
s

0      one
1      two
2    three
3       go
dtype: object

In [106]:
s.map(lambda x:x[:2])

0    on
1    tw
2    th
3    go
dtype: object

In [107]:
d = pd.DataFrame(np.arange(15).reshape(5,3), columns=["Col1", "Col2", "Col3"])
d

   Col1  Col2  Col3
0     0     1     2
1     3     4     5
2     6     7     8
3     9    10    11
4    12    13    14

Some predefined functions can be accessed in pandas using text, incl. "sum", "mean", "std", "count", "nunique"...

In [108]:
d.apply("sum",axis=0)

Col1    30
Col2    35
Col3    40
dtype: int64

In [109]:
d.apply("sum",axis=1)

0     3
1    12
2    21
3    30
4    39
dtype: int64

In [115]:
d.apply(lambda col:col["Col2"],axis=1)

0     1
1     4
2     7
3    10
4    13
dtype: int32

Pandas also has efficient dtype-specific Series methods, e.g.,
* `.dt.` methods for datetime manipulation
* `.str.` methods for string manipulation

In [116]:
s

0      one
1      two
2    three
3       go
dtype: object

In [117]:
s.str.cat(sep="-")

'one-two-three-go'

#### Arrays and lists from series and dataframes
We have already seen that, e.g., `.unique()` returns an array. There are in general ways to get lists and arrays from dataframes and series:

* `.tolist()` for lists from Series
* `.values` for arrays from Series and DataFrames

In [118]:
df.values

array([['multi', 'Guido van Rossum', 1995, 3, 'Test', 0],
       ['multi', 'John McCarthy', 1958, 33, 'Test', 1],
       ['multi', 'Bjarne Stroustrup', 1985, 4, 'Test', 2],
       ['multi', 'James Gosling', 1996, 1, 'Test', 3],
       ['functional', 'Lennart Augustsson', 1990, 40, 'Test', 4],
       ['logic', 'Alain Colmerauer', 1972, 36, 'Test', 5]], dtype=object)

In [119]:
df.year.tolist()

[1995, 1958, 1985, 1996, 1990, 1972]

#### Sorting

We can sort dataframes and series
* by values -> `.sort_values()`
* by index (or columns) -> `.sort_index()`

Both can have arguments:
* `axis=0` for rows, `axis=1` for columns
* `ascending=True` (default) for ascending or `True` for decreasing values
* `by` (sort_values) / `level` (sort_index, optional): one or more columns / index levels (when dealing with MultiIndexes) to use for sorting.
* `inplace`, as usual

In [120]:
df.sort_values(by="year",ascending=False)

           paradigm             creator  year  tiobe_idx constant  id
name
Java          multi       James Gosling  1996          1     Test   3
Python        multi    Guido van Rossum  1995          3     Test   0
Haskell  functional  Lennart Augustsson  1990         40     Test   4
C++           multi   Bjarne Stroustrup  1985          4     Test   2
Prolog        logic    Alain Colmerauer  1972         36     Test   5
Lisp          multi       John McCarthy  1958         33     Test   1

In [121]:
df.sort_index()

           paradigm             creator  year  tiobe_idx constant  id
name
C++           multi   Bjarne Stroustrup  1985          4     Test   2
Haskell  functional  Lennart Augustsson  1990         40     Test   4
Java          multi       James Gosling  1996          1     Test   3
Lisp          multi       John McCarthy  1958         33     Test   1
Prolog        logic    Alain Colmerauer  1972         36     Test   5
Python        multi    Guido van Rossum  1995          3     Test   0

#### Types of missing (NA) Data

In [124]:
for x in [None,np.NaN,pd.NaT]:
    print(x,'\t',type(x))

None 	 <class 'NoneType'>
nan 	 <class 'float'>
NaT 	 <class 'pandas._libs.tslibs.nattype.NaTType'>

In [125]:
print(None == None)
print(None is None)
print()

print(np.NaN == np.NaN)
print(np.NaN is np.NaN)
print()

print(pd.NaT == pd.NaT)
print(pd.NaT is pd.NaT)

True
True

False
True

False
True

In [126]:
print(np.NaN is np.NaN)
print(np.NaN is None)

True
False

In [127]:
print( pd.NaT is pd.NaT )
print( pd.NaT is np.datetime64("NaT") )

True
False

Pandas takes care of using the column-appropriate type of missing value:

* NaN for numeric columns
* NaT for datetime columns
* None for other kinds of columns

#### `.dropna()`

In [129]:
df.describe(include='all')

       paradigm           creator         year  tiobe_idx constant        id
count         6                 6     6.000000   6.000000        6  6.000000
unique        3                 6          NaN        NaN        1       NaN
top       multi  Guido van Rossum          NaN        NaN     Test       NaN
freq          4                 1          NaN        NaN        6       NaN
mean        NaN               NaN  1982.666667  19.500000      NaN  2.500000
std         NaN               NaN    14.908610  18.598387      NaN  1.870829
min         NaN               NaN  1958.000000   1.000000      NaN  0.000000
25%         NaN               NaN  1975.250000   3.250000      NaN  1.250000
50%         NaN               NaN  1987.500000  18.500000      NaN  2.500000
75%         NaN               NaN  1993.750000  35.250000      NaN  3.750000
max         NaN               NaN  1996.000000  40.000000      NaN  5.000000

In [130]:
df.describe(include='all').dropna()

      paradigm creator  year  tiobe_idx constant   id
count        6       6   6.0        6.0        6  6.0

As we have seen in the case of numpy arrays, we have options to perform operations along a particular axis.

* The default axis pandas uses in almost all methods and functions is axis 0 (rows)
* axis 1 (columns) must be specified using the `axis` argument

In [135]:
d = pd.DataFrame(np.ones(6).reshape(2,3))
d.loc[0,1] = "string!"
## artificially create a datetime column
d[2] = "1990-01-01"
d[2] = pd.to_datetime(d[2])

In [136]:
print("A dataframe:")
display(d)

print("\nIts types:")
print(d.dtypes)

d.iloc[1] = [None, None, None]
print("\nAfter setting row 1 to [None, None, None]:")
display(d)
print("\nand the dtypes:")
display(d.dtypes)

A dataframe:

     0        1          2
0  1.0  string! 1990-01-01
1  1.0      1.0 1990-01-01

Its types:
0           float64
1            object
2    datetime64[ns]
dtype: object

After setting row 1 to [None, None, None]:

     0        1          2
0  1.0  string! 1990-01-01
1  NaN     None        NaT

and the dtypes:

0           float64
1            object
2    datetime64[ns]
dtype: object

In [137]:
print("A dataframe:")
d[1] = {0: 0, 1: 1}
d.loc[1,0] = "two"
d

A dataframe:

     0  1          2
0  1.0  0 1990-01-01
1  two  1        NaT

In [138]:
print(".dropna():")
display(d.dropna())

print("\nequivalent to .dropna(axis=0):")
display(d.dropna(axis=0))

print("\n.dropna(axis=1):")
display(d.dropna(axis=1))

.dropna():

     0  1          2
0  1.0  0 1990-01-01

equivalent to .dropna(axis=0):

     0  1          2
0  1.0  0 1990-01-01

.dropna(axis=1):

     0  1
0  1.0  0
1  two  1

Sometimes we only want to get rid of rows with absolutely no information, but if only some of the cells are missing, we want to keep it. For that, we can use the `how` argument:
* `'any'` : If any NA values are present, drop that row or column. -> This is the default!
* `'all'` : If all values are NA, drop that row or column.

In [139]:
d.loc[2] = None
d

C:\Users\malir\AppData\Local\Temp\ipykernel_6536\488411369.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d.loc[2] = None

     0    1          2
0  1.0  0.0 1990-01-01
1  two  1.0        NaT
2  NaN  NaN        NaT

In [140]:
print(".dropna():")
display(d.dropna())

print("\nequivalent to .dropna(how='any'):")
display(d.dropna(how='any'))

print("\n.dropna(how='all'):")
display(d.dropna(how='all'))

.dropna():

     0    1          2
0  1.0  0.0 1990-01-01

equivalent to .dropna(how='any'):

     0    1          2
0  1.0  0.0 1990-01-01

.dropna(how='all'):

     0    1          2
0  1.0  0.0 1990-01-01
1  two  1.0        NaT

As with many other pandas functions and methods, `.dropna()` takes an `inplace` argument.

Another useful argument is `subset`, if you only want to check a subset of the **other axis** labels for NA values.

In [141]:
df.describe(include="all")

       paradigm           creator         year  tiobe_idx constant        id
count         6                 6     6.000000   6.000000        6  6.000000
unique        3                 6          NaN        NaN        1       NaN
top       multi  Guido van Rossum          NaN        NaN     Test       NaN
freq          4                 1          NaN        NaN        6       NaN
mean        NaN               NaN  1982.666667  19.500000      NaN  2.500000
std         NaN               NaN    14.908610  18.598387      NaN  1.870829
min         NaN               NaN  1958.000000   1.000000      NaN  0.000000
25%         NaN               NaN  1975.250000   3.250000      NaN  1.250000
50%         NaN               NaN  1987.500000  18.500000      NaN  2.500000
75%         NaN               NaN  1993.750000  35.250000      NaN  3.750000
max         NaN               NaN  1996.000000  40.000000      NaN  5.000000

In [142]:
df.describe(include="all").dropna(subset=["creator"])

       paradigm           creator  year  tiobe_idx constant   id
count         6                 6   6.0        6.0        6  6.0
unique        3                 6   NaN        NaN        1  NaN
top       multi  Guido van Rossum   NaN        NaN     Test  NaN
freq          4                 1   NaN        NaN        6  NaN

#### `.fillna()`

A versatile filling method
* fill with a single value
* "ffill" or "bfill" to forward-or backward fill values from existing values

In [143]:
d.loc[2] = 2
d

     0    1                    2
0  1.0  0.0  1990-01-01 00:00:00
1  two  1.0                  NaT
2    2  2.0                    2

In [144]:
d.fillna("Missing")

     0    1                    2
0  1.0  0.0  1990-01-01 00:00:00
1  two  1.0              Missing
2    2  2.0                    2

In [145]:
display( d.fillna(method="ffill") )
display( d.fillna(method="bfill") )

     0    1                    2
0  1.0  0.0  1990-01-01 00:00:00
1  two  1.0  1990-01-01 00:00:00
2    2  2.0                    2

     0    1                    2
0  1.0  0.0  1990-01-01 00:00:00
1  two  1.0                    2
2    2  2.0                    2

In [146]:
display( d.fillna(method="ffill",axis=1) )

     0    1                    2
0  1.0  0.0  1990-01-01 00:00:00
1  two  1.0                  1.0
2  2.0  2.0                  2.0